var business_type = {};
business_type.big = function () {
    return [
        "기타",
        "외식·음료",
        "유통·판매",
        "문화·여가·생활",
        "서비스",
        "사무직",
        "고객상담·리서치·영업",
        "생산·건설·노무",
        "IT·컴퓨터",
        "교육·강사",
        "디자인",
        "미디어",
        "운전·배달",
        "병원·간호·연구"
    ];
};
business_type.small = function (type) {
    var array = [];
    if (type === "전체") {
        array = [];
    } else if (type === "기타") {
        array = [];
    } else if (type === "외식·음료") {
        array = [
            "레스토랑",
            "패스트푸드",
            "카페·베이커리",
            "바·주점",
            "일반음식점"
        ];
    } else if (type === "유통·판매") {
        array = [
            "쇼핑몰·소셜커머스·홈쇼핑",
            "유통점·마트",
            "백화점·면세점·아웃렛",
            "편의점",
            "휴대폰·전자기기매장",
            "의류·잡화매장",
            "뷰티·헬스",
            "약국",
            "농축수산"
        ];
    } else if (type === "문화·여가·생활") {
        array = [
            "PC방·노래방",
            "호텔·리조트·숙박",
            "공인중개",
            "전시·컨벤션·세미나",
            "골프·야구·당구·볼링",
            "피트니스·스포츠",
            "찜질방·사우나·스파"
        ];
    } else if (type === "서비스") {
        array = [
            "서빙",
            "매장관리·판매·캐셔",
            "보안·경비·경호",
            "주방·조리사",
            "바리스타",
            "안내데스크",
            "주차관리·주차도우미",
            "주유·세차·청소",
            "헤어·미용·네일·피부관리",
            "이벤트·도우미",
            "모델"
        ];
    } else if (type === "사무직") {
        array = [
            "사무보조·비서",
            "문서작성·자료조사",
            "인사·총무·경리·회계",
            "마케팅·광고·홍보",
            "번역·통역·편집·교정",
            "공공기관·교육기관"
        ];
    } else if (type === "고객상담·리서치·영업") {
        array = [
            "고객상담·인바운드",
            "텔레마케팅·아웃바운드",
            "금융·보험영업",
            "일반영업·판매",
            "설문조사·리서치",
            "영업관리·지원"
        ];
    } else if (type === "생산·건설·노무") {
        array = [
            "제조·가공·조립",
            "포장·품질검사",
            "입출고·창고관리",
            "상하차·소화물분류",
            "기계·전자·전기",
            "정비·수리·설치·A/S",
            "공사·건설현장"
        ];
    } else if (type === "IT·컴퓨터") {
        array = [
            "바이럴·SNS마케팅",
            "사이트·콘텐츠운영",
            "QA·테스터",
            "시스템·네트워크·보안",
            "프로그래밍",
            "웹·모바일기획"
        ];
    } else if (type === "교육·강사") {
        array = [
            "입시·보습학원",
            "보조교사",
            "방문·학습지",
            "외국어·어학원",
            "스포츠강사",
            "유아·유치원",
            "학원"
        ];
    } else if (type === "디자인") {
        array = [
            "웹·모바일디자인",
            "그래픽·편집디자인",
            "인테리어디자인",
            "제품·산업디자인",
            "패션·잡화디자인",
            "캐릭터·애니메이션디자인"
        ];
    } else if (type === "미디어") {
        array = [
            "사진·동영상촬영·편집",
            "방송스텝·보조출연",
            "방송사·프로덕션",
            "신문·잡지·출판",
            "조명·음향"
        ];
    } else if (type === "운전·배달") {
        array = [
            "운송·이사",
            "택배·퀵서비스",
            "배달",
            "화물·중장비·특수차",
            "대리운전·일반운전",
            "택시·버스운전",
            "수행기사"
        ];
    } else if (type === "병원·간호·연구") {
        array = [
            "간호조무사·간호사",
            "간병·요양보호사",
            "원무·코디네이터",
            "외래보조·병동보조",
            "수의사·수의간호사",
            "실험·연구보조",
            "생동성·임상시험"
        ];
    }
    array.sort();
    if (type !== "전체") {
        array.unshift("기타");
    }
    return array;
};